Curso 05/Desafio - blog/blogLivros/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("Title", "Autor", "Rating", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["Title", "Senhor dos aneis"], ["Autor", "Tolkien"], ["Rating", 5], ["Description", "Lord of the rings"], ["created_at", "2023-11-22 11:55:40.156861"], ["updated_at", "2023-11-22 11:55:40.156861"]]